import 'dart:io'; 
 
void main() { 
  print("Ласкаво просимо до міні-гри 'Подорож у лісі'!"); 
  print("Ви прокинулися посеред лісу і перед вами три дороги."); 
  print("Яку дорогу ви виберете?"); 
  print("1. Піти направо"); 
  print("2. Піти наліво"); 
  print("3. Іти прямо"); 
 
  String? choice = stdin.readLineSync(); 
 
  if (choice == '1') { 
    print("Ви пішли направо і зустріли сумного шукача скарбів, який через досаду, який дав вам 'карту шукача пригод'."); 
    _askForTreasureHunt(); 
  } else if (choice == '2') { 
    print("Ви пішли наліво і натрапили на великого страшного дракона. Що ви будете робити?"); 
    print("1. Битися з драконом"); 
    print("2. Втекти"); 
 
    String? action = stdin.readLineSync(); 
    if (action == '1') { 
      print("Ви вирішили битися, але дракон виявився занадто сильним. Ви програли."); 
    } else if (action == '2') { 
      print("Ви втекли в останній момент і врятувалися."); 
    } else { 
      print("Невірний вибір, дракон вас помітив і ви не встигли втекти."); 
    } 
  } else if (choice == '3') { 
    print("Ви йдете прямо і потрапляєте до загадкової печери."); 
    print("Чи наважитесь ви зайти всередину?"); 
    print("1. Так"); 
    print("2. Ні"); 
 
    String? caveDecision = stdin.readLineSync(); 
    if (caveDecision == '1') { 
      print("Ви зайшли в печеру і знайшли всемудру книжку знань. Вітаємо тепер ви геній!"); 
    } else if (caveDecision == '2') { 
      print("Ви вирішили залишити печеру і повернулися до початкової точки."); 
    } else { 
      print("Невірний вибір, ви загубилися в лісі. І жили там до кінця життя"); 
    } 
  } else { 
    print("Невірний вибір, спробуйте ще раз."); 
  } 
} 
 
void _askForTreasureHunt() { 
  print("Чи хочете ви вирушити на пошуки скарбів?"); 
  print("1. Так"); 
  print("2. Ні"); 
 
  String? decision = stdin.readLineSync(); 
  if (decision == '1') { 
    print("Ви вирушили на пошуки і знайшли скарби. Вітаємо, ви виграли!"); 
  } else if (decision == '2') { 
    print("Ви вирішили залишитися на місці і думати про сенс життя."); 
  } else { 
    print("Невірний вибір, ви залишилися в лісі без скарбів."); 
  } 
}